Merge pull request #28 from Spepepepe/develop
develop から main への反映
